import React from 'react'
import Link from 'next/link'

const Footer = () => {
  return (
    <footer className='p-4 bg-base-200'>
      <p className='text-center text-zinc-300 mb-4 font-bold'>Hyppää Pönkelin matkaan!</p>
      <div className='flex items-center justify-center space-x-5'>
        <Link
          href='https://www.instagram.com/wappulehtiponkeli/'
          className='social text-zinc-300 hover:text-accent transition-colors'
          target='_blank'
          rel='noopener noreferrer'
        >
          <svg
            className='w-10 h-10'
            fill='currentColor'
            viewBox='0 0 24 24'
            aria-hidden='true'
          >
            <path d='M12.315 2c2.43 0 2.784.013 3.808.06 1.064.049 1.791.218 2.427.465a4.902 4.902 0 011.772 1.153 4.902 4.902 0 011.153 1.772c.247.636.416 1.363.465 2.427.048 1.067.06 1.407.06 4.123v.08c0 2.643-.012 2.987-.06 4.043-.049 1.064-.218 1.791-.465 2.427a4.902 4.902 0 01-1.153 1.772 4.902 4.902 0 01-1.772 1.153c-.636.247-1.363.416-2.427.465-1.067.048-1.407.06-4.123.06h-.08c-2.643 0-2.987-.012-4.043-.06-1.064-.049-1.791-.218-2.427-.465a4.902 4.902 0 01-1.772-1.153 4.902 4.902 0 01-1.153-1.772c-.247-.636-.416-1.363-.465-2.427-.047-1.024-.06-1.379-.06-3.808v-.63c0-2.43.013-2.784.06-3.808.049-1.064.218-1.791.465-2.427a4.902 4.902 0 011.153-1.772A4.902 4.902 0 015.45 2.525c.636-.247 1.363-.416 2.427-.465C8.901 2.013 9.256 2 11.685 2h.63zm-.081 1.802h-.468c-2.456 0-2.784.011-3.807.058-.975.045-1.504.207-1.857.344-.467.182-.8.398-1.15.748-.35.35-.566.683-.748 1.15-.137.353-.3.882-.344 1.857-.047 1.023-.058 1.351-.058 3.807v.468c0 2.456.011 2.784.058 3.807.045.975.207 1.504.344 1.857.182.466.399.8.748 1.15.35.35.683.566 1.15.748.353.137.882.3 1.857.344 1.054.048 1.37.058 4.041.058h.08c2.597 0 2.917-.01 3.96-.058.976-.045 1.505-.207 1.858-.344.466-.182.8-.398 1.15-.748.35-.35.566-.683.748-1.15.137-.353.3-.882.344-1.857.048-1.055.058-1.37.058-4.041v-.08c0-2.597-.01-2.917-.058-3.96-.045-.976-.207-1.505-.344-1.858a3.097 3.097 0 00-.748-1.15 3.098 3.098 0 00-1.15-.748c-.353-.137-.882-.3-1.857-.344-1.023-.047-1.351-.058-3.807-.058zM12 6.865a5.135 5.135 0 110 10.27 5.135 5.135 0 010-10.27zm0 1.802a3.333 3.333 0 100 6.666 3.333 3.333 0 000-6.666zm5.338-3.205a1.2 1.2 0 110 2.4 1.2 1.2 0 010-2.4z' clipRule='evenodd' /></svg>
          <span className='sr-only'>Instagram-sivu</span>
        </Link>
        <Link
          href='https://www.tiktok.com/@wappulehtiponkeli'
          className='social text-zinc-300 hover:text-accent transition-colors'
          target='_blank'
          rel='noopener noreferrer'
        >
          <svg
            className='w-8 h-8'
            fill='currentColor'
            viewBox='0 0 24 24'
            aria-hidden='true'
          >
            <path d='M24 9.83666C21.644 9.84746 19.3438 9.20834 17.4254 8.00985V16.3476C17.4294 17.9045 16.8902 19.4252 15.8801 20.706C14.87 21.9867 13.4372 22.9662 11.7738 23.5132C10.1105 24.0602 8.29608 24.1486 6.57384 23.7664C4.85159 23.3842 3.30383 22.5497 2.13806 21.3749C0.972281 20.2001 0.244209 18.741 0.0514444 17.1933C-0.14132 15.6456 0.210438 14.0833 1.05956 12.7157C1.90868 11.3482 3.21458 10.2408 4.8022 9.542C6.38981 8.84323 8.18325 8.58647 9.94209 8.80615V13.0219C9.13584 12.7942 8.26804 12.7962 7.46318 13.0276C6.65832 13.259 5.95778 13.7078 5.46205 14.3097C4.96633 14.9116 4.7009 15.6357 4.70385 16.3779C4.7068 17.1202 4.97798 17.8426 5.47849 18.4415C5.97899 19.0403 6.68308 19.4849 7.48976 19.7113C8.29644 19.9378 9.16424 19.9345 9.96866 19.7019C10.7731 19.4694 11.4728 19.0195 11.9673 18.4169C12.4619 17.8143 12.726 17.0899 12.7216 16.3476V0H17.4254C17.4251 0.34564 17.4609 0.69058 17.5323 1.03051C17.6973 1.79432 18.0383 2.52061 18.5346 3.16493C19.0309 3.80926 19.672 4.35808 20.4187 4.7778C21.4753 5.40868 22.7215 5.75098 24 5.76147V9.83666Z' />
          </svg>
          <span className='sr-only'>Tiktok-sivu</span>
        </Link>
        <Link
          href='https://www.linkedin.com/company/p%C3%B6nkeli'
          className='social text-zinc-300 hover:text-accent transition-colors'
          target='_blank'
          rel='noopener noreferrer'
        >
          <svg
            className='w-8 h-8'
            fill='currentColor'
            viewBox='0 0 24 24'
            aria-hidden='true'
          >
            <path d='M19 0h-14c-2.761 0-5 2.239-5 5v14c0 2.761 2.239 5 5 5h14c2.762 0 5-2.239 5-5v-14c0-2.761-2.238-5-5-5zm-11 19h-3v-11h3v11zm-1.5-12.268c-.966 0-1.75-.79-1.75-1.764s.784-1.764 1.75-1.764 1.75.79 1.75 1.764-.783 1.764-1.75 1.764zm13.5 12.268h-3v-5.604c0-3.368-4-3.113-4 0v5.604h-3v-11h3v1.765c1.396-2.586 7-2.777 7 2.476v6.759z' /></svg>
          <span className='sr-only'>LinkedIn-sivu</span>
        </Link>
      </div>
      <div
        className='text-zinc-300 text-center my-3'
      >
        <svg
          xmlns='http://www.w3.org/2000/svg'
          width='24'
          height='24'
          viewBox='0 0 24 24'
          fill='none'
          stroke='currentColor'
          stroke-width='2'
          stroke-linecap='round'
          stroke-linejoin='round'
          className='w-5 h-5 inline-block me-1'
        >
          <circle cx='12' cy='12' r='4' /><path d='M16 8v5a3 3 0 0 0 6 0v-1a10 10 0 1 0-4 8' />
        </svg>
        turunwappulehti@gmail.com
      </div>
      <div className='mt-4 text-center text-neutral-400'>
        <span>
          ©
          {' '}
          {(new Date()).getFullYear()}
          {' '}
          Pönkeli - Huumorihulinaa vuodesta 2021
        </span>
      </div>
    </footer>

  )
}

export default Footer
